oredev_2018_having_your_cake_and_eating_it_too_graphql_in_reason/presentation.org
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_EXTRA_CSS: /Users/s/Desktop/reactiveconf/talk.css
#+REVEAL_THEME: league
#+REVEAL_TRANS: linear
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_DEFAULT_FRAG_STYLE: appear
#+REVEAL_EXTRA_CSS: css/custom.css
#+OPTIONS: reveal_title_slide:nil num:nil reveal_history:true toc:nil
* ReasonML + GraphQL = <3
* Who am I?
- Sean Grove ([[https://twitter.com/sgrove][@sgrove]]), from SF
- Cofounder of ([[https://twitter.com/onegraphio][@OneGraphIO]])
- YC S11 / VP Eng / YC S18
- Background in Clojure(Script)/Reason/Rust
* Intro
What's the promise of typed languages?

More difficult to represent incorrect programs
#+REVEAL: split
     #+BEGIN_SRC js
function insertCustomer(name, subName, org, rating, order) {
...
}
     #+END_SRC
- What's `subName`? What does it refer to?
- What is `org`?
Ambiguous and difficult
#+REVEAL: split
So, the promise we *really* about is being happier, by being more productive
* What's Reason(ml)?
- A typed language that tries to - *ultimately* - make us happier
- ~25 years old
- Lots of academic investment
- Fantastically broad reach
  - JS
  - Native
  - Mobile
  - Unikernels
- Careful attention to developer experience
  - Including very similar syntax to JavaScript ("ES2030")
#+REVEAL: split
- Early days
  - First ReasonConf in Vienna this May
  - Second ReasonConf announced for [[https://www.reason-conf.com][April 2019]]
  - 200 people
  - Tight-knit, welcoming, close community

#+REVEAL: split
Reason focuses explicitly in making web UIs & frontends as easy as possible:
- Syntax (JSX)
- Web UIs
 - Component state + transitions
 - Routing
 - Interop with JS, including every React component in the *npm* ecosystem
#+REVEAL: split
We're all sold on Reason!
#+REVEAL: split
Still, there are challenges *within* typed languages:
- Difficult to know how to represent certain ideas
 - React.js prototype (SML)
- Some valid (or valid *enough*) programs are impossible to represent
 - Dependent types, etc.
#+REVEAL: split
Even so, typed languages like Reason are vastly more productive in their *internal* domains and systems

...and vastly *less so* outside those domains
* The new domain
Reason, Elm, Haskell, etc. all are beautiful internally, but break down as soon as we reach outside their system.

Definitely/ReasonablyTyped is a symptom of this (not as prominent in ClojureScript, for example)
#+REVEAL: split
Code libraries, ecosystems are important, but the pervasive requirement for apps today is external API dependencies.

Very few companies implement everything from the ground up now: Analytics, A/B testing, payment processing, etc.
