oredev_2018_having_your_cake_and_eating_it_too_graphql_in_reason/presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Sean Grove)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/league.css" id="theme"/>

<link rel="stylesheet" href="/Users/s/Desktop/reactiveconf/talk.css"/>

<link rel="stylesheet" href="css/custom.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org6247043">
<h2 id="org6247043">ReasonML + GraphQL = &lt;3</h2>
</section>
</section>
<section>
<section id="slide-org19e6899">
<h2 id="org19e6899">Who am I?</h2>
<ul>
<li>Sean Grove (<a href="https://twitter.com/sgrove">@sgrove</a>), from SF</li>
<li>Cofounder of (<a href="https://twitter.com/onegraphio">@OneGraphIO</a>)</li>
<li>YC S11 / VP Eng / YC S18</li>
<li>Background in Clojure(Script)/Reason/Rust</li>

</ul>
</section>
</section>
<section>
<section id="slide-org9cf6209">
<h2 id="org9cf6209">Intro</h2>
<p>
What's the promise of typed languages?
</p>

<p>
More difficult to represent incorrect programs
</p>
</section>
<section >
<div class="org-src-container">

<pre><code class="js" >function insertCustomer(name, subName, org, rating, order) {
...
}
</code></pre>
</div>
<ul>
<li>What's `subName`? What does it refer to?</li>
<li>What is `org`?</li>

</ul>
<p>
Ambiguous and difficult
</p>
</section>
<section >
<p>
So, the promise we <b>really</b> about is being happier, by being more productive
</p>
</section>
</section>
<section>
<section id="slide-org77664c8">
<h2 id="org77664c8">What's Reason(ml)?</h2>
<ul>
<li>A typed language that tries to - <b>ultimately</b> - make us happier</li>
<li>~25 years old</li>
<li>Lots of academic investment</li>
<li>Fantastically broad reach
<ul>
<li>JS</li>
<li>Native</li>
<li>Mobile</li>
<li>Unikernels</li>

</ul></li>
<li>Careful attention to developer experience
<ul>
<li>Including very similar syntax to JavaScript ("ES2030")</li>

</ul></li>

</ul>
</section>
<section >
<ul>
<li>Early days
<ul>
<li>First ReasonConf in Vienna this May</li>
<li>Second ReasonConf announced for <a href="https://www.reason-conf.com">April 2019</a></li>
<li>200 people</li>
<li>Tight-knit, welcoming, close community</li>

</ul></li>

</ul>

</section>
<section >
<p>
Reason focuses explicitly in making web UIs &amp; frontends as easy as possible:
</p>
<ul>
<li>Syntax (JSX)</li>
<li>Web UIs
<ul>
<li>Component state + transitions</li>
<li>Routing</li>
<li>Interop with JS, including every React component in the <b>npm</b> ecosystem</li>

</ul></li>

</ul>
</section>
<section >
<p>
We're all sold on Reason!
</p>
</section>
<section >
<p>
Still, there are challenges <b>within</b> typed languages:
</p>
<ul>
<li>Difficult to know how to represent certain ideas
<ul>
<li>React.js prototype (SML)</li>

</ul></li>
<li>Some valid (or valid <b>enough</b>) programs are impossible to represent
<ul>
<li>Dependent types, etc.</li>

</ul></li>

</ul>
</section>
<section >
<p>
Even so, typed languages like Reason are vastly more productive in their <b>internal</b> domains and systems
</p>

<p>
&#x2026;and vastly <b>less so</b> outside those domains
</p>
</section>
</section>
<section>
<section id="slide-orgf7ec777">
<h2 id="orgf7ec777">The new domain</h2>
<p>
Reason, Elm, Haskell, etc. all are beautiful internally, but break down as soon as we reach outside their system.
</p>

<p>
Definitely/ReasonablyTyped is a symptom of this (not as prominent in ClojureScript, for example)
</p>
</section>
<section >
<p>
Code libraries, ecosystems are important, but the pervasive requirement for apps today is external API dependencies.
</p>

<p>
Very few companies implement everything from the ground up now: Analytics, A/B testing, payment processing, etc.
</p>
</section>
</section>
